s = {1, 2, 3, 4, 5, 5, 6, 7, 7}
print(s)  # {1, 2, 3, 4, 5, 6, 7}   集合不可以重复

b = set(range(6))
print(b)  # {0, 1, 2, 3, 4, 5}

s.add(8)
print(s)  # 添加一个{1, 2, 3, 4, 5, 6, 7, 8}
s.update({10})
print(s)  # 添加多个{1, 2, 3, 4, 5, 6, 7, 8, 10}

s.update([100, 200, 22])
print(s)  # {1, 2, 3, 4, 5, 6, 7, 8, 100, 10, 200, 22}
s.update((33, 55, 66))
print(s)  # {1, 2, 3, 4, 5, 6, 7, 8, 100, 10, 200, 33, 66, 22, 55}

s.remove(100)
print(s)  # {1, 2, 3, 4, 5, 6, 7, 8, 10, 200, 33, 66, 22, 55}

s.discard(500)
print(s)  # 不会报错

s.pop()
print(s)  # 不能添加参数 {2, 3, 4, 5, 6, 7, 8, 10, 200, 33, 66, 22, 55}

s.clear()
print(s)  # 清空 set()
